README.org
#+TITLE: Sensorimotor learning basic lib

#+OPTIONS: toc:nil ^:nil

* Sensorimotor learning basic lib

A python library of code i use for sensorimotor learning experiments
with simulations, robots, etc. Performing clean-up and incremental
pull from existing private repository. The basis idea is to generate
states (sensors) with actions (motors), learn different models from
that data to approximate the sensorimotor dynamics and use the models
to improve future actions.

** reservoir lib

|----------------+---|
| reservoirs.py  |   |
| eligibility.py |   |
| learners.py    |   |
