README.md


# Sensorimotor learning basic lib

A python library of code i use for sensorimotor learning experiments
with simulations, robots, etc. Performing clean-up and incremental
pull from existing private repository. The basis idea is to generate
states (sensors) with actions (motors), learn different models from
that data to approximate the sensorimotor dynamics and use the models
to improve future actions.


## reservoir lib

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">reservoirs.py</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">eligibility.py</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">learners.py</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

